{"podcast_details": {"podcast_title": "The Richard Nicholls Podcast", "episode_title": "Brain Training", "episode_image": "https://storage.buzzsprout.com/variants/zer7wqcccku95enno1ma0s32i6jx/2a0b0dfa96ac0f52f5e0059e82dcd227fca7bcc798acc4833c7df068e886f95e.jpeg", "episode_transcript": " Hello there, you fabulous people, and happy Friday to you! Today, I've got a little bit of psychoeducation for you. And I want to remind you about the influence our past has on our present. And I want to tell you about how to move on from that and why people can get so stuck. So, by the time we're 16 and getting ready to learn more about ourselves, we've already probably had around 6 million minutes of experiencing the waking world. But our brain can only remember the important bits. So it compares everything we experience to previous experiences and chooses whether or not it needs to be deleted or stored. And it uses the meaning behind the experience to do that. Because the meaning behind everything gives us an emotional reaction. And that emotional reaction, whether good or bad, gives our brain the information it needs to say whether it needs to influence the next similar experience or not. Back in the day, we only needed to survive one tiger experience to then have an emotional reaction to every rustle in the bushes behind us. Because our brains latched on to the meaning behind the tiger and stuck it onto a small bird that flaps its wings as it takes off from the bush. Better to be safe than sorry. But is it really better to be safe than sorry in 2023 in a mostly toigelous land? Because that's what anxiety is. Our brain giving us unsafe feelings in a safe environment so as to be better safe than sorry. And behaviorists would say to overcome it, you need to actually have some startling experiences and train the brain that they're actually safe. And yeah, that works. But you need to feel safe when you do it. Otherwise, all the brain learns is that danger is everywhere and anxiety has to be our default state because of it. It's always the meaning behind the experience that makes it important to us. And that's the same reason why people are so desperate to show their friends photos of their kids and grandchildren on holidays and things. I love my friends. I would do if any of you were listening. But I'm not interested in all of your holiday photos and you're not interested in all of mine. I might be interested in you and you might be interested in me. But a huge majority of the things that you might associate with feeling good won't make me feel anything at all because it wasn't me that had the experience. But because we associate those pictures with the memories and the memories with the emotions, those pictures feel more important than they are. And one thing that I think would be really useful to do to prevent our brain from holding on to the stuff that feeds our anxiety and instead hold on to the good stuff is related to sleep. Because it's whilst we sleep that the brain is consolidating those memories and deciding which neurological wiring to prune and what to strengthen. The brain doesn't know the difference between fact and fiction. And if we can focus more on the experiences we had in the day that are worth remembering, that are safe, we stand a better chance that the other stuff can get pruned whilst we sleep. So if we want our brain to hold on to certain functions and make them effortless and unconscious, we need to give it some directions. And so before you go to bed, I want you to ask yourself this question. Out of all the things I've experienced today, what are the things I'd want to remember tomorrow or this time next week? What are the things I'd want to remember next year? Basic gratitude stuff, really, but simpler. Go through your day looking for even the simple things that are worth remembering. What did you have for breakfast? Because that was safe, hopefully. Who was the first person in your day that you had a positive interaction with, no matter how small or seemingly ordinary the experiences were? If at the time you were using the neurons in your brain for this is safe, then you want to remember how that feels. Because your brain can then prune away the other stuff whilst you sleep, then you see. So you go do that. Enjoy your weekend. Look me up on Patreon if you'd like to hear more, of course, and I'll speak to you again very soon. Take care."}, "podcast_summary": "In this podcast episode, the host discusses the influence of our past on our present and provides insights on how to move on from that and avoid getting stuck. The host explains that our brain compares everything we experience to previous experiences and decides whether to retain or delete them based on their meaning. Our emotional reactions to these experiences provide information to the brain to influence future similar experiences. The host mentions that anxiety is the brain giving us unsafe feelings in a safe environment, as it wants to prioritize safety over potential dangers. To overcome anxiety, behaviorists suggest having startling experiences that are proven to be safe. However, it is essential to feel safe during these experiences, or else the brain can learn that danger is everywhere, leading to anxiety becoming the default state. The host emphasizes that the meaning behind experiences determines their importance to us. This is why people tend to show photos of their children and grandchildren to friends, as the pictures are associated with memories and emotions. To prevent the brain from holding onto anxiety-triggering thoughts, the host suggests focusing on positive experiences before sleep. By practicing basic gratitude, such as reflecting on safe, enjoyable moments throughout the day, the brain can strengthen positive memories and prune away unnecessary ones while we sleep. The episode concludes with the host encouraging listeners to reflect on their day and identify moments worth remembering before going to bed.", "podcast_highlights": "- The brain compares experiences to previous ones and determines whether to store or delete them based on their significance and emotional reaction.\n- Anxiety is the brain giving unsafe feelings in a safe environment to be cautious.\n- Overcoming anxiety involves having positive experiences that train the brain to feel safe.\n- Memories and emotions are associated with photos, making them feel more significant than they are.\n- To promote positive memory consolidation during sleep, focus on the safe and memorable experiences of the day before bed."}