{"podcast_details": {"podcast_title": "The Rest Is Football", "episode_title": "All 20 PL Clubs Predicted!", "episode_image": "https://megaphone.imgix.net/podcasts/30860506-223b-11ee-9234-a787dafa51ef/image/TRIF_ARTWORK_FINAL_V2.jpeg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Welcome to the Rest is Football with me, Gary Lineker, alongside Alan Shearer and Micah Richards and with the Premier League kicking off tonight, it's time for our season predictions. On today's episode, we're going to go through all 20 Premier League teams to look at what they've been up to this summer and how we think they're going to get on this year. This is going to be a slightly different episode. Let me just tell you, because we wanted to do a special looking at all the teams going ahead this season rather than our future episodes, which mostly will be chatting about events, what's happened, what's going to happen, our stories, et cetera. But this one, we're going to be focused on each and every team. And we'll start before we go to those teams, Micah, with how you think Burnley will get on against your old club. Ooh, it's going to be tough. I'm going to the game tonight, so I'll see, you know, I'll keep a close eye on it. I think with Burnley... Well, you have to because you're the ambassador. Burnley invited me actually. I'm in the program and everything to be honest, Alan. I've got more than just Man City friends. You do know that, don't you? I'm not surprised. Big mix is everywhere. Everyone loves him. I think the way Burnley approach football is the new modern way. They've got a great manager, a great person first and foremost, and the way he's been able to implement his style of play at Burnley so soon, I think Burnley will have a massive effect. And in terms of how Sheffield United, when they first came, you know, a couple of seasons ago, I think they'll be vulnerable at times when they're attacking. I think they'll concede a lot of goals, but I think they'll stick to their characteristics. I think they'll be very entertaining and I think there'll be a few surprises in how they do in the Premier League. Tough opener for them, Alan, though. Yeah, I mean, it couldn't have been any tougher. I think they'll make it very difficult for Man City this evening. I think I'm expecting a good game. You're never going to see players at their very best until they're up to speed and after four or five games. But I do expect them to give a good game because I think the atmosphere there will be tough. It'll be hard for City. But I just think their quality will get through in the end and I would expect them to win tonight. OK, let's get started because 20 teams, it's going to take quite a while to get through. We want you to talk about all the clubs on this podcast, not just focus on obviously the top few. What we're going to do, we're going to get them into categories. We're going to go through each team in alphabetical order. I want us all to decide whether they'll be the champions in the top four, Europe, mid table, in a relegation fight or relegated. Alan, Micah, it's time to lay your cards on the table. We're going to start with you might think Arsenal or even Aston Villa, but no, it's Bournemouth because it's AFC Bournemouth. So therefore, there you go. Come on, Gary. We try and do things right. Bournemouth's an interesting one, isn't it? Because a lot of people tipped them to go down last season. They managed to stay up. Gary O'Neill did a fabulous job when he came in for Scott Parker and then, slightly bewildering perhaps, they let him go at the end of the season and we've now got Andoni Iraiola who's come in. What do we make of that decision? I thought it was very, very harsh after the job he did. I thought it was a miracle that he kept them up. I mean, the way Scott Parker left basically got himself sacked after that terrible result at Anfield, wasn't it? But then, yeah, I thought Gary did a great job and without doubt he deserves to be given the opportunity at least to do the same again. So for him to not even make it to pre-season was very harsh. So I mean, you don't make any friends by doing that, but I don't suppose the owners want to make friends. They want to get results and they're entitled to make that decision. But I think it'll be another tough, long, hard season for Bournemouth and I'll see them in a relegation battle again. Well, they've brought in Andoni Iraiola and his style has been described as rock and roll. We'll take that though, won't we? You know, sometimes... Well, can you do that with the players perhaps that Bournemouth have got? No, but us as broadcasters, I think it'll be really entertaining. I think that's what we want to see. We want to see a little bit of flavour, a little bit of source within the league. But if I'm being totally honest, I agree with Alan. It was, I won't say stupid to get rid of O'Neil, but it just got them to a place of stability where you could build on that and then get rid of that. So I think Bournemouth are going down. Sorry Bournemouth fans, I think they're going down. Well, I see where you're coming from, Micah, but I think they'll struggle. I think they'll just about avoid relegation. I didn't like what they did to Gary O'Neil, but he has got another job which we will discuss towards the end of the podcast. Let's move on to Arsenal. It's interesting signing David Rea. I don't know what that means for Ramsdale as he bought in as a replacement or as a backup because you've got to have two good keepers nowadays, I guess. Yeah, I know you have to have two good goalkeepers, Gary, but when you've got two very good goalkeepers and two number ones, because that's essentially what they are. I mean, Ramsdale had a really good season last season, played a huge part in what Arsenal did. And Rea had a very good season and played a huge part in what Brentford did. So yeah, that's a tough one and trying to keep both number ones happy is going to be a tough job for Arteta. We kind of covered a little bit in the first podcast that we did, didn't we? Where we thought who would win the title race and I said, I thought Arsenal will win it. Jesus is subsequently injured, but I'm going to stick with my prediction at that point. I mean, if they can improve one position from last season, they'll do well. No, I agree. I think they will challenge. I think it's going to be top, you know, we're saying top four, but I think it'd be top two. I just think with Arsenal. Psychologically, how important was it to win the Community Shield? Massive, massive for them and the fans to believe because, you know, they know they can beat Man City. I mean, if Foden takes that chance when he goes through, made a great save from Ransdale, wasn't it? But I just think with Man City, who they can apply on the pitch or bring on at any time and the quality they can bring. With Arsenal, where Jay-Zus got injured, they just came a different team. They wasn't as potent in front of goal. Of course, last season with Saliba getting injured was massive for them. And Kechey had a good run at it, didn't he, for a little while? Yes, he had an amazing run, really good young player. I think he's got a really good future ahead of him. Can Havertz play as a nine, Alan? Well, he's playing as a nine at Chelsea. Come on, Al. Well, he can, but I'm not sure he can do the job that they would want. I mean, they've already got a problem with here, Zeus, haven't they? So in terms of injuries. Yeah, I would have them in second position, me. I just think that the quality that City have, I just expect City to do the same again. They may have a slow start, they may have a little bit of a hangover, but they've proved that they can recover from that. But I do see Arsenal pushing City all the way again, because I've been impressed with their sign-ins. So, I mean, they've spent an absolute fortune. Two hundred million. The back of the manager, absolutely. So, and you're not spending that to finish second again. I can tell what they want and their intentions. They want to go out and they're going to want to go one better. But I just think with City's quality, I'm going to go with City again. OK, well, I'm going to stick with Arsenal. I think Reiss didn't make a real difference. I thought he had a terrific game in the Community Shield, as did Timber as well, there was their other signing, of course. Let's move on to Aston Villa. They had a brilliant season, didn't they? Last year, they finished seventh. But of course, they've got to cope with that busy European schedule now because they're in the European Conference League. So, how will they do? He did a great job, Emery, didn't he? Well, he's the man that knows how to navigate Europe, that's for sure as well. He's a very clever coach and by all accounts, they love him at Villa. Made some clever sign-ins as well, I think. So yeah, not so much as a surprise package because everyone sort of saw them and what they did last season. But I've got them challenging, certainly they go better than they did last year in a top six. Okay, Mike, they made some interesting signings. Pau Torres in particular. Jori Thielmann has got on a free, that's a good sign and I've watched him play for years, for Leicester of course. And someone called Rico Richards, I thought I read Mike Richards for a free from West Bromwich Albion. Can they improve on what they did last season? It's a big ask to do that. I think they'll be there or thereabouts where they were. I think the extra games will be difficult, but I want to talk specifically about Pau Torres. He has got all the ability to be a world-class centre-half. He's left-footed. I watched him a lot in the Champions League. He played against Man United in Europa League. And he's just, the way he moves the game at Villarreal and the way he comes out with a ball, his technique for a centre-half, for a modern-day player is exactly what he is. It might take him a little bit of time to adjust to the physicality of the Premier League, but once he does that and the competition with Mings as well, I think he's going to be one of the signings of the season. Yeah, they've had a good pre-season as well. And Diaby as well. Diaby's a good player as well. He might score a few. So where have you got them, Micah? What's your...? I'm going to say seventh, eighth, similar to last season, fighting for Europe. I'm going to go Europe as well. I think for Aston Villa, I think they'll do well. I really like him, I think he's a terrific coach. And talking of terrific coaches, let's move on to Brentford. What a season they had last year, didn't they? In ninth place, good manager. Yeah, good manager. Clever manager. Clever manager and that stadium is bouncing, which obviously helps them. But what is going to be a huge miss for them is Tony with his suspension. They finished last season in ninth, which as you said, was remarkable. I don't have them doing so well this year. But again, I think they'll be in and around mid-table, which for Brentford, I think they would be more than happy with, wouldn't they? Brentford have though lost their goalkeeper, David Rea. He's just gone to Arsenal. That's going to be a big loss for them, isn't it? Even though they've got the obviously Fleckens coming in, they were ready for that. Yeah, a bit of a surprise. Rea going to Arsenal, be a big loss for Brentford. I know they've made a huge profit on him, but they have signed Mark Flecken from Freiburg for around about £11 million. So they obviously knew something was going to happen in that department, but he will be a big loss to him because he's a very, very good goalkeeper. I would be at the same, Alan, as you and Gary, mid-table. I don't think they will do any better than that. That would be good though, wouldn't it? Yeah, absolutely. It'd be great, but you're missing Tony. I only have them mid-table just because I believe what the manager is saying and the message and the style of play which is implemented. So I will say, yeah, mid-table, great season for Brentford. And Wermo's got to step up this year. Yeah, I'm going to say the same mid-table because of Frank. I think he's excellent. It's a well-run club as well. As is Brighton, another team. We've got three clubs on the bounce there, haven't we? Aston Villa, Brentford and now Brighton that all performed brilliantly. Probably with the three surprise packages of last season, they finished sixth. They've got European football and they played some beautiful stuff last season, didn't they? They're standing. They're just, again, another modern day team because when I went to Italy to play and you watch all the teams, they play the same way, but they've just got better players. The same when you go to Spain as well. Whereas when you come to the Premier League, you have to be a little bit different and they've managed to play great football, really get good recruitment in and then managed to find gems while still playing at the same level. Moises Caicedo will be very important for them if they can. They've lost McAllister already. That'd be really tough for them to cope with, wouldn't it, Alan? Yeah, I'd be surprised if he was still a Brighton player come the end of the transfer window, I think, with who's chasing him. I know there'll be tough negotiators, but I think in the end they'll get what they want. So for that reason, I'm in sixth they were last year, I think, and I don't see them getting into that position again, particularly with Luzon, as you said, McAllister and possibly him. So I've got them in and around mid-table. I'm hearing of a young lad called Simon Adingra, he's 18-year-old Evorian who's had a brilliant pre-season apparently. I'm hearing he's a bit tasty. Looking forward to seeing him on match of the day. Yeah, and scored a couple of goals in pre-season. When a young though, it's a big ask for someone at that age to come in and do so well in the Premier League. But yeah, they'll be safe again. I expect them to play that great football and passing out from the back. I've seen a couple of clips in pre-season, one where they played Newcastle was just unbelievable. You were watching the Newcastle game, were you not? Of course. Doing my homework. Just before we go on, Joe Pedro. Remember I said it here first. Obviously people know about him because he was at Watford, but he's only young. I thought he was a lot older than he was. He'll be outstanding for Brighton this year. Brighton's recruitment has been brilliant in recent seasons as well. So I'm going to go with them in a mid-table position. Alan? Yeah, I'm going to have them mid-table. I think they'll find it difficult in, particularly in Europe, with the number of players that they'll have to use. Yeah, I've got them comfortably in mid-table. Micah? I echo that mid-table. Right, it's the turn of Burnley. We've obviously already mentioned them because they're playing in the opening fixture this evening against Manchester City. But in general terms, it's very interesting, isn't it, with Vincent Kompany that he actually started pre-season two or three weeks earlier than all the other clubs. He brought them in. Does that surprise you, Narnan Micah? No, it doesn't surprise me. That's exactly what he's like. I remember when I was his assistant captain and I had to take care of all the fines and everything and if a find wasn't on his desk by the end of the day, he'd give me a fine. He's that sort of person. When he's in it, he's in it. Fine the finer. Fine the finer. But I just think Burnley will compete because of the style he's been able to implement so soon and he's a perfectionist. So until he gets exactly what he wants, he won't stop. And that's why they were so successful in the championship. Excited to see what he could do in the Premier League now. I believe he can do it, but he just needs to show everybody now and I think they'll do that. I tell you, I'm looking forward to seeing, which is quite unusual. We've mentioned a few of them actually in this podcast. Goalkeepers. But they've signed James Trafford, haven't they, from Manchester City for 19 million. And he was obviously one of the big stars of the England under-21 winning team this summer. Didn't concede a goal. He made that fantastic penalty save right at the death. So it'd be interesting to see how he fares. Yeah, it's always, as we know, a really, really tough position at any age, but for a youngster going in there. And he's going to be tested because at times they're going to be under pressure this season. A lot of times they're going to be under pressure. So yeah, it's a big season for him and they've paid a lot of money for him. So they're expecting big things from him. So you're right. Yeah, we'll look forward to see how he does. Just one thing. His interview after he saved the penalty, he said he knew he was going to save it. It was just so blasé by himself. I just love that confidence. I just love it. Yeah, it was terrific. I'm going to go for Burnley to fight relegation, but stay up. What about you two? Yeah, me the same. I think they'll have enough to stay up when I look around who are going to be in the relegation battle. I think they'll have too much and it'll be tough for them at times this season and they'll be under pressure a lot of times, but they'll have enough to stay up in my opinion. I'm going to go mid table. I'm putting a lot of... I knew you would. You don't upset Vincent, do you? Look at him looking after his mate. Look at him. I want to get into players lounge and all that. Just because you're in the program on Friday night, that's what you said, isn't it? Yeah, he's going to the ground. Everyone's going to go, oh, Micah, thank you so much. Why don't you go to Full Hog and say European football? No, no. Let's not push it now, Gary. I think probably one of the most difficult clubs to predict this season will be Chelsea, but I think surely we can safely say they will be higher than last season's incredibly low 12th position. Yeah, they'll definitely be better than 12th. I mean, it was pretty embarrassing what happened with Chelsea last year, I think. Why do you think it did? What went wrong? Was it the managilieria errors? Was it ownership buying too many players? What was it? You've got to try and give your coach the best opportunity possible. I just don't think the owners did that. I thought they made it very difficult, not impossible, very, very difficult with the number of players they brought in. How on earth as a manager can you keep that many players happy? It was almost impossible for them, so 12th position it was, but they'll improve on that. I think it's a great sign-in and getting Pochettino, very clever manager, coach. They've made some decent sign-ins and there's still a couple of weeks to go and I'm sure they'll sign a couple more to give them the best opportunity. I know and Kunku's going to be out there for a few months with a knee injury, which is really unfortunate, but I've got them challenging for Europe again. I don't see them getting into the top four, but I do think they'll challenge for Europe again and they have to with the money that they spend. Michael? I just don't know, Al. You think about when you was a manager in Newcastle and if you would have been given a ray of talent, you would have picked the best out of that talent. And still gone down. So when you say owner, as a manager, owner's dream, apart from if the owner's saying, you must play this player, but if he's just bringing in talent for you to pick your best 11 or best squad with, surely as a manager that's what you want. I think too many excuses was aimed at the ownership of Chelsea last season, but I think they'll do a lot better. I agree with Alan in terms of the manager. I really rate him. We worked with him at the World Cup, really intelligent, knows exactly what he wants. So I'm going to say just missing out on top four, but going for Europa League. Yeah. It's interesting the amount of players that were actually gone. Mount, Kovacic, Loftus, Cic, Pulisic, Mendy, Albama, Jan, Athpilicueta, Kante. That's a squad in itself. So I think it's going to take probably time, although they've had a good pre-season. Nicholas Jackson's been scoring a few goals, good signing we think from Villarreal. So I'm going to go with European football like Alan, but I can't see top four. I think it's too big a gap to bridge. I think just miss out on Chabby's league, Europa League, just miss out. Yeah. Europa League it is. Right. Crystal Palace. Interesting one. They're going to have to do without Wilfred Zaha for the first time in an awfully long period. So it'd be interesting to see how they do. Yeah, I still think they'll have enough talent and they've gone with Roy again with his know-how, with his experience. So yeah, they'll have enough. Really excited to see Frank, who they've brought in, youngster from Brazil. Hopefully bring a few goals. 26 million quid. And did you see, I saw that he had a few add-ons including one that he'll get five million quid extra if he wins the Ballon d'Or. And I thought to myself, if he wins the Ballon d'Or playing for Crystal Palace, I mean, Steve Parish needs to dig a bit deeper than that. Surely. If he gets a Ballon d'Or, Micah will give him the five million as well, wouldn't he, Micah? Be careful. Although I'm not on the same wage as anyone else. Yeah, we should learn by that mistake Linneke made. We'll be looking forward to seeing Eze again. He really shone last season, didn't he? Eze and Elise, yeah. If they can keep hold of him, I know there's been interest. But yeah, I don't see them battle and relegation. I don't see them challenging for Europe. I see them mid-table. Yeah, Roy Hodgson. He's a reliable, safe pair of hands that they rely on. Mid-table Micah or better or worse? I think struggle. I think struggle worse. I think Zaha took on so much for that team. Yes, Elise, great young talent. Eze, he'll step up and be the main man. But Zaha got him out of a pickle so many times in recent history. So I'm just going to go staying up, but struggling. Struggling to avoid relegation. I'm going to go with Alan, mid-table. Yeah. Now, the next club I'm a little bit worried about is a former player of Everton. They had a really tough time last season. I don't think the fans will be particularly encouraged by what's happened in the summer. I think even Sean Dyche himself has described it as a difficult window. Could be another tough battle. But if there is a man that can keep a side up, then he's done that and he's got lots of experience in doing it. Micah? I think Sean Dyche will get the best out of. With Burnley, if you look at recent history, they always were really fit, had a style of play, is at a full pre-season. I think Everton will struggle, but I don't think they will go down. I think they'll avoid relegation purely on the structure of the team and grinding results out. I know the last couple of seasons have not been pretty, but now you can forget last season. What I am a little bit baffled by is their signings. They're bringing Ashley Young, experienced pro. I get that. Could play a variety of different positions. But then they've only got Dan Juma, who I think is an excellent signing for them, but they need more. If they're going to stay up and stay up convincingly, they need more. But I just think they'll avoid relegation. Well, they've only got the two players in and one of them is Ashley Young and you mentioned Dan Juma. But out has gone Sims, Jerry Mina, Tom Davis, Begovic, a bit of experience, and Andros Townsend. And of course, Conor Cody, that experience that he brought, Alan. You have to worry for them, don't you? Yeah, I would be very worried if I was an Everton fan. I think it's a football club that looks to be in trouble. And as soon as something can happen in terms of ownership or whatever, I don't know. But I would be really worried if I was an Everton fan with what they've got at this moment in time. I know they've got Calvert Lewin, but he's got his injury issues. If they can clear that up and keep him fit, then it might be different. How long have you been saying that for? Absolutely. I don't see that happening. I'm going to have them safe from relegation only because of their manager and who and what he is and he's been there before and he knows how to navigate. But I see them having a long, hard season and surviving just. I'm going to say the same thing purely for emotional reasons, I think. But I do fear the worst in some way. Right, onto Fulham. Another one of last season's, I think, star performance. They're punched well above the weight that perhaps a lot of people thought they would do. They finished banging halfway in 10th place and pretty much fancied them doing the same thing again. It seems to be tougher sometimes in the second season. I think there's a lot to sort out there. It looked as if he was going, Marco Silva, and Mitrovic said he wasn't going to play again. And those are two big questions, aren't they? Absolutely, yeah. I know they've got Raul Jimenez, so whether they're expecting something to happen and they may think he could replace Mitrovic. But if they can resolve those issues, then in and around mid-table again, I think, maybe not as high as 10th, but somewhere around there, 11th, 12th, 13th. Yeah, tough to replace someone like Mitrovic though, isn't it, Micah? Such a handful. Yeah, you can't replace Mitrovic. He's too much of an asset to that team, the way they want to play. He knows the club. He had something to prove. Everyone called him a championship striker. He showed he can do it on the Premier League. But I think Jimenez is a master stroke signing. Get him for little money. Someone thinks best years are behind him with that horrendous injury that he had on his head. I just believe this is a massive comeback season for him. And even if Mitrovic was to leave, I think Jimenez can do the business. I think they'll be lower than last season. I think they'll struggle against relegation, but I think they'll stay up. Okay, we're going to take a little break now. After it, we'll have Liverpool, Manchester United, and we might even talk about Newcastle as well, Alan. Yes, please. NFL Sunday Ticket is now on YouTube and YouTube TV, which means that it just got easier to be an NFL fan, even if you live far away. Like maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday Ticket, your out of market team is never more than a short distance away, specifically the distance from you to your remote control. NFL Sunday Ticket, now on YouTube and YouTube TV. Go to youtube.com slash presale to get $50 off. Terms and embargoes apply. All friends, 919, no refund. Subscription auto renews. On to Liverpool. Had a bad season really by their standards, didn't they? Certainly under Jürgen Klopp, but they started to show a sign of form and a bit more encouragement towards the end of the seasons. They've kind of shifted, certainly in midfield area, haven't they? Yeah, they've had to because of the players that they've lost and they lose the influential voice of Henderson in there and his character. I know he maybe not has played as much as he wanted to, but he's still in the dressing room and still a great character. So losing that, but the sign-ins that they've made, I still have one or two issues defensively with them, but I see them being better than they were last season. I see them being better than in fifth position. I've got them qualifying for the Champions League. Yeah, I'm the same. I've got them in the Champions League qualification this season. I think they could push quite closely towards the title. Obviously, they've lost a few players, but the interesting thing we're talking about midfield is the emergence of Trent Alexander-Arnold in that midfield converted position. I've been crying for him to play midfield for years because I think he's the best passer of the football in the English game. Do you expect him to continue that role, Micah? Yeah, I do. I think it helps him out defensively as well. So when you're putting your team and have a structure and the way he was getting in positions as a right back, it almost felt like he's always chasing the game or chasing his opponent. But when he goes into that midfield role, the way he plays and the way he presses, he can stop attacks from midfield knowing that he's got protection behind. And we all know what he can do on the ball. I mean, Gary, you've been saying it for a while now. I just think he's exceptional and I think he will carry on in that position and it could help Liverpool in that central area, which they've lacked at times. It's been too easy to go from back to front. So I'm excited to see what they can do. Yeah, they brought in McAllister and Sir Bob Sly as well. If that's how you say it, we'll have to work that one out before we start match of the day, exactly how you pronounce his name. But he certainly looks like he's got some talent, Alan. Yeah, absolutely. I agree with that. But I don't think their business in terms of transfer is finished also. So I think they'll still get another one or two in by the time the end of August comes. And that's why I've got them finishing the Champions League spot. Yeah, so have I. I think they'll go quite close and I think I'm going to make a prediction that Darwin Nunes will score a lot of goals this season. He's had a good pre-season as well, hasn't he? Yeah, absolutely. We'll move on now. Luton Town. This is a fascinating little story, isn't it? Obviously they've got still some work to do on their ground to get it fit for the Premier League, but it's quite a story. Small club of course, but they've been in the top flight before. In my time, they were actually a pretty good team. They had lots of really, really good players. It's going to be tough though, surely. Go on, Michael, you can go first. Unfortunately, sorry Luton fans, I've got you to go down. Just the experience. I think they're going to be too overwhelmed with the Premier League. They play some good football, but having watched them a couple of the games last season, especially the playoffs, I think they need a little bit more for Premier League football. I think it's a great story. I'm glad they got here, but I think it's going to be too much for them. I've got them to go down. Yeah, Robert did a great job and getting them where they are and getting them into the Premier League. You can see the celebrations that they had. No, I just don't see them having enough quality and I see them being relegated again. They have made a few signings. They've got in Ross Barkley on a free from Nice, which is nice. They've also got Ryan Jarls from Wolves, Tahiti Chong from Birmingham for four million, Anderson from Barnsley. They've gone towards the lower leagues. They have got Issa Caboria from Manchester City on loan and they spent two and a half million quid on Thomas Komuniski. Is it going to be enough, Micah? No, it's not. It's not enough. I think we all think they'll go down, but who knows? Yeah, let's hope. Let's hope they don't, but yeah, I think they're going down. Manchester City, they're definitely not going down. We've already tipped them. We made our predictions, didn't we, in the first podcast and you both went with Manchester City. What can we look forward to most? They play some exhilarating football. They've just won the treble. They're the obvious favourites for the league. What will Pep invent this year, tactically? He'll probably put Kovacic up front, won't he? He's a good signing, isn't he? Oh, wow. He's very excited about Kovacic. I mean, I think he's a really good player, but he doesn't exactly bang loads of goals in or create too many chances. No, but it's different, Gary. I mean, Gundogan was a marvellous, marvellous, marvellous player. We know what he could do. He was sort of underrated at times, was Gundogan. But in terms of Kovacic and what he can bring, the way he can dribble past players, the way he's so effortless, the way he's coming to the system and not looked out of place without even proper learning the system. I think he'll score more goals. I think he'll be a joy to watch. I think he's going to have a big season at Manchester City. Can Harlan score more goals than what he did? Gary? Well, if he scores the same amount, it would be extraordinary or even a few less. I mean, who knows in the team that he's playing? I'm kind of a little bit more interested in the other end of the team. I mean, Harlan, we know he'll score a shedload of goals. But Guardiola signed Vardyol, a player that we enjoyed watching, didn't we, during the World Cup? Although Messi did turn him inside out, didn't he, in the semi-final. But I mean, just when you think, oh, maybe they've lost one or two players have left, they make a signing like that and you go, cool, they're going to be tough to beat again. Yeah, they will be. And he's a very good player, despite what Messi did to him. We saw enough in Qatar, didn't we, to know that he's going to be very good for them, a great asset for them and he's only going to strengthen them. So yeah, I've got them winning the title just ahead of Arsenal. Yeah. Pep actually thanked Messi for bringing the price down on Guardiola, apparently. Which I thought was quite a mooch. Now I know you both go Manchester City for the title. I'm going to put them in second place, I think, but not with any confidence, I'm just going to add. Let's move on to the other side in Manchester United. It's been a steady progress under Ten Hag. Do you think they can continue to improve? Alan? In terms of position-wise, maybe not, because I'm going to have them, I've got them certainly in Champions League again, but I've got them in fourth position this year rather than where they finished last season in third. I think they've made some very good sign-ins, which obviously will improve them. Really looking forward to seeing what Rasmus Hoiland can do. I know he's a youngster, they've paid a lot of money for him, but it's a lot of expectation on his head and how they're going to play him and Rashford in that team. So yeah, I'm impressed. You can't be anything but impressed with the job that Ten Hag's done. Interesting the big change obviously in goal. With Inanna coming in, he's probably much more comfortable with his feet and that's important to the way Ten Hag plays, Micah. Yes, and I think that's exactly what they needed. In the Champions League final, watching him up close and personal, he really has got that presence. I was sad to see De Gea go because I thought he was a legend for the club, did so well for them, but they needed to freshen it up. They got there, but I'm disappointed with Man United. I expected Man United to go all out in terms of bringing in a lot of top quality players. Go all out for Kane, go all out for Ossiman, go out for the best players that are available in the market. They've spent nearly 200 million. Yeah, but Hoyland's outstanding, but he's only young. What is he, 20 years of age? I mean, you can't be hanging that hopes on such a young player. Get Hoyland and another. So I'm disappointed. I just see them similar to last season. I say top four. Top four, yeah. The four for me. Yeah. I'll put them in the top four as well. I'm really looking forward to seeing Mason Mount play for Manchester United. I think like most of Chelsea's players last season, they underperformed, but there was an obvious reason for that. I think Mount's an exceptional talent and I look forward to seeing him play. I think Manchester United top four for me as well. Now then, here we go, Alan. Just reached your team, Newcastle United. Made a couple of signings in the last couple of days as well, which has probably heightened your expectations. Encouraged a little bit? Yeah, absolutely. I mean, the job Eddie and everyone did last year was amazing. No one saw that in terms of getting into Champions League spots. But I think they'll find it very difficult to do the same again, particularly because how others have improved. I know they've spent a few quid. Tonoli, I'm sure, will be very good. We took Harvey Barnes from your Leicester and he's had a decent start in terms of the pre-season games. Liv Rimento, they've spent a lot of money and I'll be interested to see how or when they can get him in the team because there's no moving Trippier at this moment in time with the... But Trippier can play both sides, Alan. Yeah, he could do. That may be what he's thinking of. He didn't play a lot last season because he had that serious injury, didn't he? They have spent a lot of money on him. So I'd be surprised if he was to go straight into the team. I don't think it'll be for a few months until you see the best of him. But I think it'll be a miracle if Newcastle get in the top four again. Really? Yeah, I do, yeah. As much as I'd love it to happen, I think with Champions League football, with maybe a good cup run and maybe Nick in one of the Cups this year, the FA Cup or the League Cup, I think then if Newcastle were to have a similar season than last season, I think it would be a job well done. So I've got them finishing in fifth this year. What about up front, Micah? Can they score enough goals? Need to keep Callum Wilson fit? Yeah, I really like Isak. He's talented. There was plenty of times last season where he was out on the left-hand side and because he's so comfortable on the ball, they have him out there. But I want to see him as a number nine. He's the lead man and I think give him that confidence, give him the chances, he will score. Callum Wilson's always going to score goals. But I just think if Newcastle really want to challenge and play the attacking, the flow, the football they play, Isak needs to start. So I'm saying just going to miss out on Champions League. I've got him down as fifth. Yeah, I'm going to say the same thing. I think Eddie Howe's outstanding, meticulous in his coaching and I think he'll bring the very best out of them. I think you're in for another exciting season. And obviously they've got to deal with playing in the Champions League as well. The atmosphere at St James' Park on Champions League night is going to be electric. You wouldn't mind finishing fifth if you win the Champions League. But not many teams will fancy coming to St James' with the atmosphere that it's going to be. So I'm really looking forward to that. I think it's going to be another really good season for Newcastle, but we might just miss out on top four. Yeah, I'm going Europe as well. Yeah. Right, Nottingham Forest just survived in the last season. They had so many new players at the start of last season, didn't they? Almost like a whole complete new squad. And I think with good management from Cooper, they managed to stay up and they stuck with him, didn't they? Even when they were struggling. And I think a lot of clubs can perhaps learn from that. If you think you've got someone good in charge, don't just panic soon as a team does badly. Yeah, they didn't make it easy for him last year, did they? In what they gave him at the beginning of the season, the number of players for him to have and to mould together. But yeah, I thought he did a fabulous job. It was a really difficult job. But even with what they've brought in, I still think it's going to be a long, hard season. Unfortunately, I see Forest as one of the three that could go. So you've got Forest in the bottom three, Alan? I have, yes. Oh dear. Micah? Wow! Alan, no! They've got too much quality. They've got too much quality to... Well, when I say quality, too many quality players. As long as they keep the squad and there's no more outs before the transfer window is over. Yes, I don't think they're going to pull up trees and go top ten, but I think they've got enough quality to stay in the league. So I've got them avoiding relegation. I'm looking forward to seeing a Langer play for them. He's at Manchester United. I thought he showed a lot of promise. So that would be interesting. I think they'll stay up. And as a Leicester fan, I'd love us to swap places with them, but not really. I think they'll stay up. A battle against relegation again, but be safe. Sheffield United, I'm not sure the same will be true for them. The supporters are not that happy. I actually saw some tweets from Matt Fitzpatrick, the US Open champion of a year or so ago, who's a big Sheffield United fan saying, what on earth is going on at our club? We're just not making enough signings. We're letting players go and the club's in a mess. So that doesn't bode well, Alan. No, and even the manager, Paul Hekenbottom, is saying the same thing. Still saying they're way short on numbers and probably quality signing, selling one of their best players, if not their best player, and die. Yeah, I just can't see anything other than them going back down again. I don't know what's going on at Sheffield United in terms of what they think they can do with what they've got. So yeah, I've got them being relegated. It's a shame, isn't it? Because obviously they were in the Premier League a few seasons ago and they played some good stuff and now they've got the opportunity again. It looks like the manager might not get the support he needs, Micah. No, they need to be better within the market, get some top quality players in. But just from a legend's point of view, real leader, captain, letting Billy Sharp go in one of the most important seasons they've had for a couple of seasons, it seems strange to me because not all captains need to play week in, week out. You have a captain who's going to be great around the dressing room, can integrate the young lads, know what it means to play for the club. I've seen an interview with him when he left and he looked very disgruntled. I just think going into the Premier League, winning the championship, you need all these little things to come together. The signings at the moment just don't look good enough. So I have them to go down as well. I think that's unanimous, isn't it, Alan? Yeah, it's going to be very, very difficult for them. As I said, they sell them one of their best players. Even, yeah, there's no hope really from a lot of their supporters, if you to believe social media. I've got a couple of friends who are Sheffield United fans as well, and they are really, really worried. And even then, even their saying they've got no chance. Right, let's move on to Tottenham Hotspur. Last season, obviously very disappointing, finished in eighth place. Despite that, Harry Kane scored loads of goals. Hopefully at this point, we're still not entirely sure whether Harry is going to go or not, which will make a massive difference either way. They have brought in, interestingly, James Madison, who I think is a fabulous signing and an absolute snip at 40 million. I think he's a supremely talented young footballer. How do we think they're going to fare? Micah? I absolutely love the manager. Costa Coglu, I worked with Chris Sutton many times and he banged on about him for years and years and years when he was in the J-League. And then when he got the Celtic job, everyone questioned it. Is he the right person for it? And the style of football he plays, he's great in interviews. I spoke to Joe Hart and he said, when he came, Joe Hart said, I just need someone who's going to put their arm around me. Give me the confidence. He did exactly that. But he's strict at the same time and he won't take any nonsense. So I think mix all them together with a style of football. I think Spurs are going to be entertaining again. And I'm looking forward to seeing Madison because I just think he's exceptional. And they spent the right few quid at centre-half position, haven't they? Mickey van de Ven and a young Argentinian forward. Yeah, Madison's a really good signing. If he can link up with Kane, then I think everything depends on Harry Kane. It's really hard to predict with Tottenham, isn't it? Because they're so reliant and dependent on the great man. Yeah. Look what he did. I mean, he had one of his best seasons ever last season, Harry. I mean, he was brilliant, wasn't he? And he still finished eighth. And I know where the signings they had, but everything I think depends on whether Harry stays or goes. Well, he didn't go to Barcelona. Go, Harry, go! Well, he didn't go to Barcelona, did he, in the week? That probably says something, doesn't it, Alan? He's going, isn't he? I don't know. I mean, whether Daniel's going to continue to dig his heels in and say no, whether he thinks there's a chance Harry might sign a new deal. I don't know. I think it's 50-50 whether he's going to go. And their season depends on it, in my opinion. I don't see them challenging for the top four even with him. But without him, I would see them in and around eighth or ninth, something like that. Yeah, wouldn't disagree. Alan, you're going to have to hold on to the champagne just for a little while until we find out whether he's going. I'm slightly biased because obviously I really like Spurs as I played there for three years. So I'm going to go European football, which in itself is, I don't know, it's not really where I think Tottenham fans think they should be and perhaps shouldn't be as a club. It should be challenging for the Champions League. But I think it's going to be a big ask, particularly without a certain Harry Kane. Mike, where are they going to finish? I'm going Europa League. I have one of the Europa League positions. I think they'll finish in Europe. I'm excited by this fresh Spurs side. Well, you mentioned the Europa League and we can move on to the Europa Conference League. Winners last season, terrific effort from West Ham. Can they move on from there and perform? Because in the league, they had a really tough season, didn't they? They narrowly avoided relegation. Yeah, it was a tough season for them in the league. But that doesn't matter when you consider what they won. You could see what it meant to David Moyes and to the West Ham fans. It's been really strange pre-season, I think, for West Ham because they must have known for a while that Declan was going to be leaving and then for them to be so slow in the transfer market and know they're after Maguire and McTominay and one or two others. But they've been really, really slow, which hasn't been that positive in terms amongst their fans. Yeah, again, I don't see them mid-table. I don't see them being relegated. I see them having enough for that. I still think they've got work to do in the transfer market. So I've got them in and around 12th, 13th. Yes, they have had a slow summer, but it's picked up a bit. They've signed James Ward-Prowse from Southampton for 30 million. And as you said, Alan, they're also rumoured to be in for Harry Maguire and Scott McTominay. They'd be good additions, wouldn't they, Micah? Yeah, I think the whole thing with Harry Maguire now, it's becoming a little bit boring. I think it's just borderline. Some of the stuff you read on social media, it's just become a meme. Unfair. That's what it is, Micah. I think it's unfair. He's a cracking player. He's a really good on the ball. He's a great pro. What more do you need than that, Gary? Yes, he's made some bad mistakes. Sometimes in your career, the pressure and the level at that moment in time just becomes a little bit too much. And unfortunately, he's made too many mistakes for the top level, but that doesn't mean he's not a good player. So I think if you can get him and McTominay, get his confidence back, I think it'll be very good shoot signings. I'm going mid-table for West Ham. I think they've still got Bowen. He scores lots of goals. I like Fournals as well. They've got some all-around good players, good manager, David Moyes, proven year in, year out. And mid-table, everyone? Yeah, in and around mid-table for me. Maybe just below. Yeah, agreed. Agreed. We move on to our final team. And we always have their problems, don't they? Coming into the start of the season, parted company with Julen Lopetegui. They brought in Gary O'Neill, of course, but so close to the start of the season. Surely that's problematic, Alan? Yeah, worrying times for Wolves. Once the owners had sent a letter out to the Wolves fans, that didn't give them much hope. And the managers are leaving even before balls kicked. You know there's issues and problems. So yeah, I see them in a relegation battle with Wolves this year. Micah? Yes, I would have to agree. You know when you look at Wolves' team last season, you think, some great young talent there, but they never really take it up a notch. It's almost like you're waiting and you're waiting and you're waiting for them to do something and they'll play very good for 70 minutes. Then there's no end product. I think they've got enough quality to stay in the league, but I think they'll be struggling. I agree with Alan. I think they'll avoid relegation, but yeah, I think it'd be a tough all season. I'm not so sure. I think they might go down. I think I've got them in my bottom three. Losing Reuben Nevers as well. That's a massive, massive loss, I think. I think that could cost them. If the club's in turmoil, that's a bad place to be starting the Premier League season. I agree. Yeah, it doesn't look pretty there. Problems there, so yeah, difficult season for them. Okay. Well, we got through all 20 teams. I know some of you will like what we said. Some of you won't like what we said, depending on who you support. Don't take it personally. Don't take it personally ever. Don't forget, we get a lot of things wrong. There's one thing football does, it embarrasses you at some point. Those are our predictions. Some will be right, some will be wrong. We'll be back on Monday for another episode, a more normal episode. This was obviously a special one off. We'll be back with the rest of this football reflecting on the opening weekend. Before that, I will of course be on match of the day and you two, I believe, will be joining me. Can't wait to get started. Here we go again, another season. Looking forward to it. Finally, I've made the A-team, can I say? Yeah, only because Wright is on away doing other things. On that note, goodbye everyone. Thank you very much for listening and thanks for the amazing feedback we've had so far. It really is appreciated and we're absolutely chuffed."}, "podcast_summary": "In this podcast episode, Gary Lineker, Alan Shearer, and Micah Richards discuss their season predictions for all 20 Premier League teams. They start by discussing how Burnley and Sheffield United might perform in their opening match. They then go alphabetically through the teams, discussing their summer moves and how they expect them to fare in the upcoming season. For Arsenal, they discuss the signing of Aaron Ramsdale and how they expect them to challenge for a top-four finish. Aston Villa is praised for their successful season last year and their potential to do well in the European Conference League, while Bournemouth is predicted to struggle and potentially face relegation. Brighton is expected to finish mid-table, while Burnley is predicted to fight against relegation and potentially survive. Chelsea's signings and potential to challenge for the top four are discussed, and Crystal Palace is predicted to finish mid-table again. Everton's slow transfer window and need for more signings is highlighted, and they are expected to struggle against relegation. Fulham is predicted to narrowly avoid relegation, and Leeds United is expected to finish mid-table again. Leicester City is predicted to fight for a European spot, while Liverpool is expected to challenge for the title again. Manchester City is predicted to win the league, and Manchester United is expected to finish in the top four. Newcastle United is predicted to finish in Europe, and Norwich City is expected to be relegated. Nottingham Forest is also predicted to be relegated, while Sheffield United is expected to struggle and potentially go down. Southampton is predicted to finish mid-table, and Tottenham Hotspur is expected to finish in Europe. West Ham is predicted to struggle again, and Wolves is expected to be involved in a relegation battle. Overall, the hosts discuss each team's potential and make predictions for where they will finish in the Premier League table.", "podcast_guest": {"name": "Andoni Iraiola", "summary": "Guest summary not found"}, "podcast_highlights": "Here are the highlights of the podcast episode:\n\n- The hosts discuss Burnley's chances against Micah Richards' former club, Manchester City.\n- They go through each Premier League team and predict where they will finish in the table this season.\n- Arsenal is seen as a strong contender for a top-four finish, with their new signings and improved squad.\n- Aston Villa is expected to do well, especially in the European Conference League, but may struggle with the busy schedule.\n- Brentford's style of play and their new signings have impressed the hosts, but they may have a tough season.\n- Brighton's passing game and solid recruitment make them a mid-table team this season.\n- Bournemouth is predicted to have a tough season and be involved in a relegation battle.\n- The hosts discuss Arsenal's signing of Aaron Ramsdale and the potential role of Bernd Leno in the team.\n- Crystal Palace's decision to let go of Gary O'Neil is seen as harsh, and their season could be challenging.\n- Everton's slow transfer market activity could affect their position in the table, but they are expected to avoid relegation.\n- Fulham is expected to struggle, but they could avoid relegation.\n- Leicester City is predicted to have a mid-table position, with the potential to challenge for Europa League spots.\n- Liverpool is predicted to finish in the top four, and their signing of Ibrahima Konaté is highlighted.\n- Manchester City is predicted to win the Premier League again, with their strong squad and signings.\n- Manchester United is expected to finish in the top four, with the potential signing of Harry Maguire and Scott McTominay.\n- Newcastle United is predicted to finish in the top four, with European football as a realistic target.\n- Nottingham Forest is expected to battle against relegation, and Sheffield United is predicted to be relegated.\n- Southampton's lack of signings and issues at the club could lead to a relegation battle.\n- Tottenham Hotspur's position in the table depends on whether Harry Kane stays or goes, but European football is predicted.\n- West Ham United is expected to finish in mid-table, with some good signings and their previous positive season.\n- Wolverhampton Wanderers is predicted to be involved in a relegation battle, with the departure of key players and managerial turmoil."}